danielbernalb/esp32-hpma115s0/src/main.cpp
/**
 * @file main.cpp
 * @author Antonio Vanegas @hpsaturn
 * @date June 2018 - 2019
 * @brief HPMA115S0 sensor on ESP32 with bluetooth GATT notify server
 * @license GPL3
 */

#include <Arduino.h>
#include <OTAHandler.h>
#include <Wire.h>
#include <InfluxArduino.hpp>
#include <CanAirIoApi.hpp>
#include <ConfigApp.hpp>
#include <ArduinoJson.h>
#include <numeric>
#include <hpma115S0.h>
#include <BLEDevice.h>
#include <BLEServer.h>
#include <BLEUtils.h>
#include <BLE2902.h>
#include <WiFi.h>
#include <esp_wifi.h>
#include <Adafruit_Sensor.h>
#include <Adafruit_AM2320.h>
#include <Adafruit_BME280.h>
#include <Adafruit_AHTX0.h>
#include <DHT.h>
#include <GUIUtils.hpp>
#include <vector>
#include <sps30.h>
#include "main.h"
#include "status.h"

/******************************************************************************
* S E T U P  B O A R D   A N D  F I E L D S
* ---------------------
* please select board on platformio.ini file
******************************************************************************/

#ifdef WEMOSOLED // display via i2c for WeMOS OLED board & TTGO18650
U8G2_SSD1306_128X64_NONAME_F_SW_I2C u8g2(U8G2_R0, 4, 5, U8X8_PIN_NONE);
#elif ESP32DevKit // display via i2c for ESP32-DevKitC - U series
U8G2_SSD1306_128X64_NONAME_F_SW_I2C u8g2(U8G2_R0, OLEDclockd, OLEDdatad, U8X8_PIN_NONE);
#elif ESP32C // display via i2c for ESP32C
U8G2_SSD1306_128X64_NONAME_F_SW_I2C u8g2(U8G2_R0, OLEDclock, OLEDdata, U8X8_PIN_NONE);
#elif HELTEC // display via i2c for Heltec board
U8G2_SSD1306_128X64_NONAME_F_SW_I2C u8g2(U8G2_R0, 15, 4, 16);
#elif TTGO_TQ // display via i2c for TTGO_TQ
U8G2_SSD1306_128X32_UNIVISION_F_HW_I2C u8g2(U8G2_R0, U8X8_PIN_NONE, 4, 5);
#else       // display via i2c for D1MINI board
U8G2_SSD1306_64X48_ER_F_HW_I2C u8g2(U8G2_R0,U8X8_PIN_NONE,U8X8_PIN_NONE,U8X8_PIN_NONE);
#endif

// HPMA115S0 sensor config
#ifdef WEMOSOLED
#define HPMA_RX 13  // config for Wemos board & TTGO18650
#define HPMA_TX 15  // some old TTGO18650 have HPMA_RX 18 & HPMA_TX 17
#elif ESP32DevKit
#define HPMA_RX PINRXSENd  // config for ESP32DevKit
#define HPMA_TX PINTXSENd
#elif ESP32C
#define HPMA_RX PINRXSEN  // config for ESP32C
#define HPMA_TX PINTXSEN
#elif HELTEC
#define HPMA_RX 13  // config for Heltec board, ESP32Sboard & ESPDUINO-32
#define HPMA_TX 12  // some old ESP32Sboard have HPMA_RX 27 & HPMA_TX 25
#elif TTGO_TQ
#define HPMA_RX 13  // config for TTGO_TQ board
#define HPMA_TX 18
#else
#define HPMA_RX 17  // config for D1MIN1 board
#define HPMA_TX 16
#endif

/******************************************************************************
*   S E N S O R  M E T H O D S
******************************************************************************/

/**
 * [DEPRECATED] sensorConfig:
 * The next method is only if Honeywell sensor was config without autosend
 */
#ifdef HONEYWELL
void sensorConfig(){
  Serial.println("-->[HPMA] configuration hpma115S0 sensor..");
  hpmaSerial.begin(9600,SERIAL_8N1,HPMA_RX,HPMA_TX);
  hpma115S0.Init();
  delay(100);
  hpma115S0.EnableAutoSend();
  delay(100);
  hpma115S0.StartParticleMeasurement();
  delay(100);
  Serial.println("-->[HPMA] sensor configured.");
}
#endif

#ifdef SENSIRION
void ErrtoMess(char *mess, uint8_t r){
  char buf[80];
  Serial.print(mess);
  sps30.GetErrDescription(r, buf, 80);
  Serial.println(buf);
}

void Errorloop(char *mess, uint8_t r){
  if (r) ErrtoMess(mess, r);
  else Serial.println(mess);
  setErrorCode(ecode_sensor_timeout);
  delay(500); // waiting for sensor..
}
#endif

void sensorInit(){
#ifdef HONEYWELL
  Serial.println("-->[HPMA] starting hpma115S0 sensor..");
  delay(100);
  #ifndef TTGO_TQ
  hpmaSerial.begin(9600, SERIAL_8N1, HPMA_RX, HPMA_TX);
  #else
  if(WrongSerialData == false){
    hpmaSerial.begin(9600, SERIAL_8N1, HPMA_RX, HPMA_TX);
  }
  delay(100);
  #endif
#elif PANASONIC
  Serial.println("-->[SN] starting SN-GCJA5 sensor..");
  delay(100);
  #ifndef TTGO_TQ
  hpmaSerial.begin(9600, SERIAL_8N1, HPMA_RX, HPMA_TX);
  #else
  if(WrongSerialData == false){
    hpmaSerial.begin(9600, SERIAL_8N1, HPMA_RX, HPMA_TX);
  }
  delay(100);
  #endif
#else //SENSIRION
// Begin communication channel
 SP30_COMMS1.begin(115200, SERIAL_8N1, HPMA_RX, HPMA_TX);
  Serial.println(F("-->[SPS30] starting SPS30 sensor.."));
  if (sps30.begin(&SP30_COMMS1) == false){
    Errorloop((char *)"-->[E][SPS30] could not initialize communication channel.", 0);
  }
  // check for SPS30 connection
  if (sps30.probe() == false){
    Errorloop((char *)"-->[E][SPS30] could not probe / connect with SPS30.", 0);
  }
  else
    Serial.println(F("-->[SPS30] Detected SPS30."));
  // reset SPS30 connection
  if (sps30.reset() == false){
    Errorloop((char *)"-->[E][SPS30] could not reset.", 0);
  }
  // start measurement
  if (sps30.start() == true)
    Serial.println(F("-->[SPS30] Measurement OK"));
  else
    Errorloop((char *)"-->[E][SPS30] Could NOT start measurement", 0);
  if (SP30_COMMS == I2C_COMMS){
    if (sps30.I2C_expect() == 4)
      Serial.println(F("-->[E][SPS30] Due to I2C buffersize only PM values  \n"));
  }
#endif
}

void wrongDataState(){
  setErrorCode(ecode_sensor_read_fail);
  gui.displaySensorAverage(apm25);
  gui.displaySensorData(0,0,chargeLevel,0.0,0.0,0);
#ifdef HONEYWELL
  Serial.print("-->[E][HPMA] !wrong data!");
  #ifndef TTGO_TQ
    hpmaSerial.end();
  #endif
#elif PANASONIC
  Serial.print("-->[E][SNGC] !wrong data!");
  #ifndef TTGO_TQ
    hpmaSerial.end();
  #endif
#else
  Serial.print("-->[E][SPS30] !wrong data!");
#endif
  statusOff(bit_sensor);
  WrongSerialData = true;
  sensorInit();
  delay(500);
}

/***
 * Average methods
 **/

void saveDataForAverage(unsigned int pm25, unsigned int pm10){
  v25.push_back(pm25);
  v10.push_back(pm10);
}

unsigned int getPM25Average(){
  unsigned int pm25_average = round(accumulate(v25.begin(), v25.end(), 0.0) / v25.size());
  v25.clear();
  return pm25_average;
}

unsigned int getPM10Average(){
  unsigned int pm10_average = round(accumulate(v10.begin(), v10.end(), 0.0) / v10.size());
  v10.clear();
  return pm10_average;
}

void averageLoop(){
  if (v25.size() >= cfg.stime){
    apm25 = getPM25Average();  // global var for display
    apm10 = getPM10Average();
  }
}

