danielbernalb/esp32-hpma115s0/src/main.cpp
char getLoaderChar(){
  char loader[] = {'/','|','\\','-'};
  return loader[random(0,4)];
}

void showValues(int pm25, int pm10){
  gui.displaySensorAverage(apm25); // it was calculated on bleLoop()
  gui.displaySensorData(pm25, pm10, chargeLevel, humi, temp, rssi);
  gui.displayLiveIcon();
  saveDataForAverage(pm25, pm10);
  WrongSerialData = false;
}

/***
 * PM2.5 and PM10 read and visualization
 **/

void sensorLoop(){
#ifndef SENSIRION
  int try_sensor_read = 0;
  String txtMsg = "";
  while (txtMsg.length() < 32 && try_sensor_read++ < SENSOR_RETRY){
    while (hpmaSerial.available() > 0){
      char inChar = hpmaSerial.read();
      txtMsg += inChar;
#ifdef HONEYWELL
      Serial.print("-->[HPMA] read " + String(getLoaderChar()) + "\r");
#else
      Serial.print("-->[SNGC] read " + String(getLoaderChar()) + "\r");
#endif 
    }
#ifdef HONEYWELL
    Serial.print("-->[HPMA] read " + String(getLoaderChar()) + "\r");
#else
    Serial.print("-->[SNGC] read " + String(getLoaderChar()) + "\r");
#endif
  }
  if (try_sensor_read > SENSOR_RETRY){
    setErrorCode(ecode_sensor_timeout);
#ifdef HONEYWELL
    Serial.println("-->[HPMA] read > fail!");
    Serial.println("-->[E][HPMA] disconnected ?");
#else
    Serial.println("-->[SNGC] read > fail!");
    Serial.println("-->[E][SNGC] disconnected ?");
#endif
    delay(500); // waiting for sensor..
  }
#endif

#ifdef PANASONIC
  if (txtMsg[0] == 02){
    Serial.print("-->[SNGC] read > done!");
    statusOn(bit_sensor);
    pm25 = txtMsg[6] * 256 + byte(txtMsg[5]);
    pm10 = txtMsg[10] * 256 + byte(txtMsg[9]);
    if (pm25 < 2000 && pm10 < 2000){
      showValues(pm25, pm10);
    }
    else
      wrongDataState();
  }
  else
    wrongDataState();

#elif HONEYWELL // HONEYWELL
  if (txtMsg[0] == 66){
    if (txtMsg[1] == 77){
      Serial.print("-->[HPMA] read > done!");
      statusOn(bit_sensor);
      pm25 = txtMsg[6] * 256 + byte(txtMsg[7]);
      pm10 = txtMsg[8] * 256 + byte(txtMsg[9]);
      if (pm25 < 1000 && pm10 < 1000){
        showValues(pm25, pm10);
      }
      else
        wrongDataState();
    }
    else
      wrongDataState();
  }
  else
    wrongDataState();

#else // SENSIRION
  delay(35); //Delay for sincronization
  do {
    ret = sps30.GetValues(&val);
    if (ret == ERR_DATALENGTH){
      if (error_cnt++ > 3) {
        ErrtoMess((char *)"-->[E][SPS30] Error during reading values: ", ret);
        return;
      }
      delay(1000);
    }
    else if (ret != ERR_OK){
      ErrtoMess((char *)"-->[E][SPS30] Error during reading values: ", ret);
      return;
    }
  } while (ret != ERR_OK);

  Serial.print("-->[SPS30] read > done!");
  statusOn(bit_sensor);

  pm25 = round(val.MassPM2);
  pm10 = round(val.MassPM10);

  if (pm25 < 1000 && pm10 < 1000){
    showValues(pm25, pm10);
  }
  else
    wrongDataState();
#endif
}

void statusLoop(){
  if (v25.size() == 0) {
    Serial.print("-->[STATUS] ");
    Serial.println(status.to_string().c_str());
    updateStatusError();
    wifiCheck();
  }
  gui.updateError(getErrorCode());
  gui.displayStatus(wifiOn,true,deviceConnected,dataSendToggle);
  if(triggerSaveIcon++<3) gui.displayPrefSaveIcon(true);
  else gui.displayPrefSaveIcon(false);
  if(dataSendToggle) dataSendToggle=false;
}

String getNotificationData(){
  StaticJsonDocument<40> doc;
  doc["P25"] = apm25;  // notification capacity is reduced, only main value
  String json;
  serializeJson(doc,json);
  return json;
}

String getSensorData(){
  StaticJsonDocument<150> doc;
  doc["P25"] = apm25;
  doc["P10"] = apm10;
  doc["lat"] = cfg.lat;
  doc["lon"] = cfg.lon;
  doc["alt"] = cfg.alt;
  doc["spd"] = cfg.spd;
  doc["sta"] = status.to_string().c_str();
  String json;
  serializeJson(doc,json);
  return json;
}

void getHumidityRead() {
 #ifdef BME280S 
  humi = bme.readHumidity();
  temp = bme.readTemperature();
  if (isnan(humi)){
    humi = 0.0;
    bme.begin(0x76);
  }
  if (isnan(temp))
    temp = 0.0;
  Serial.println("-->[BME280] Humidity: "+String(humi)+" % Temp: "+String(temp)+" °C");
 #elif DHT22S
  humi = dht.readHumidity();
  temp = dht.readTemperature();
  if (isnan(humi)){
    humi = 0.0;
    dht.begin();
  }
  if (isnan(temp))
    temp = 0.0;
  Serial.println("-->[DHT22] Humidity: "+String(humi)+" % Temp: "+String(temp)+" °C");
 #elif AHT10
  sensors_event_t humidity, temp;
  aht.getEvent(&humidity, &temp);// populate temp and humidity objects with fresh data
  Serial.println("-->[AHT10] Humidity: "+String(humidity.relative_humidity)+" % Temp: "+String(temp.temperature)+" °C");
 #else
  humi = am2320.readHumidity();
  temp = am2320.readTemperature();
  if (isnan(humi)){
    humi = 0.0;
    am2320.begin();
  }
  if (isnan(temp))
    temp = 0.0;
  Serial.println("-->[AM2320] Humidity: "+String(humi)+" % Temp: "+String(temp)+" °C");
 #endif 
}

void humidityLoop(){
  if (v25.size() == 0){
    getHumidityRead();
  }
}

void humTempInit(){
#ifdef ESP32DevKit
 #ifdef BME280S
   //Wire.begin(16, 21);   //I2C_SDA, I2C_SCL
   bme.begin(0x76, 16, 21);
 #elif DHT22S
   dht.begin();
 #elif AHT10
 I2CBME.begin(18, 19);
  if (! aht.begin(&I2CBME)) {
    Serial.println("Could not find AHT? Check wiring");
    delay(10);
  }
  Serial.println("AHT10 found");
 #else
   //Wire.begin(16,21);   //I2C_SDA, I2C_SCL
   Wire.begin(HUMSDAd,HUMSCLd);   //I2C_SDA, I2C_SCL
 #endif
 #elif ESP32C
 #ifdef BME280S
   //Wire.begin(16, 21);   //I2C_SDA, I2C_SCL
   bme.begin(0x76, 16, 21);
 #elif DHT22S
   dht.begin();
 #elif AHT10
 I2CBME.begin(23, 22);
  if (! aht.begin(&I2CBME)) {
    Serial.println("Could not find AHT? Check wiring");
    delay(10);
  }
  Serial.println("AHT10 found");
 #else
   //Wire.begin(16,21);   //I2C_SDA, I2C_SCL
   Wire.begin(HUMSDA,HUMSCL);   //I2C_SDA, I2C_SCL
 #endif
#else
 #ifdef BME280S
   bme.begin(0x76);
 #elif DHT22S
   dht.begin();
 #else
   am2320.begin();   //I2C_SDA, I2C_SCL
 #endif
#endif
}

/******************************************************************************
*   B A T T E R Y   C H A R G E   S T A T U S   M E T H O D S
******************************************************************************/
// IP5306_2 = pin 27 ESP32, pin 2 IP5306
// IP5306_3 = pin 26 ESP32, pin 3 IP5306

void batteryloop() {
#ifdef TTGO_TQ
  Rdelay = 0;
  while (digitalRead(IP5306_2) == HIGH)
  {
    delayMicroseconds(100); // Sincronization in 1
  }
  delayMicroseconds(50); // Probably double shoot in 0
  while (digitalRead(IP5306_2) == HIGH)
  {
    delayMicroseconds(100); // Sincronization in 1
  }
  while (digitalRead(IP5306_2) == LOW && Rdelay < 56)
  {
    delayMicroseconds(100); // Sincronization in 0
    Rdelay = Rdelay + 1;
  }
  if (Rdelay > 52)
  {
    chargeLevel = 0; // 0%
    return;
  }
  delayMicroseconds(1600);
  if (digitalRead(IP5306_2) == HIGH)
  {
    delayMicroseconds(100);
    if (digitalRead(IP5306_2) == HIGH)
    {
      chargeLevel = 100; // 100%
      return;
    }
  }
  if (digitalRead(IP5306_3) == LOW)
  {
    delayMicroseconds(100);
    if (digitalRead(IP5306_3) == LOW)
    {
      chargeLevel = 25; // 25%
      return;
    }
  }
  delayMicroseconds(1100);
  if (digitalRead(IP5306_3) == HIGH)
  {
    delayMicroseconds(100);
    if (digitalRead(IP5306_3) == HIGH)
    {
      chargeLevel = 75; // 75%
      return;
    }
  }
  if (digitalRead(IP5306_3) == LOW)
  {
    chargeLevel = 50; // 50%
    return;
  }
#endif
}

